tutorials/multiphase/reactingMultiphaseEulerFoam/RAS/fluidisedBedReaction/constant/phaseProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      phaseProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

type interfaceCompositionPhaseChangeMultiphaseSystem;

phases (air particles1 particles2);

air
{
    type          reactingPhaseModel;

    diameterModel constant;
    constantCoeffs
    {
        d               1;
    }
    Sc 0.7;

    residualAlpha   0;
}
particles1
{
    type          purePhaseModel;

    diameterModel constant;
    constantCoeffs
    {
        d               125e-6;
    }

    alphaMax        0.63;
    residualAlpha   1e-6;
}

particles2
{
    type          reactingSolidPhaseModel;

    diameterModel constant;
    constantCoeffs
    {
        d               9e-4;
    }

    alphaMax        0.63;
    residualAlpha   1e-6;
    Sc 0.7;
}

blending
{

    default
    {
        type                none;
        continuousPhase     air;
        minFullyContinuousAlpha.air 0;
        minPartlyContinuousAlpha.air 0;
        minFullyContinuousAlpha.particles1 1.0;
        minPartlyContinuousAlpha.particles1 1.0;
        minFullyContinuousAlpha.particles2 1.0;
        minPartlyContinuousAlpha.particles2 1.0;
    }
}

interfaceCompression
(
);

interfaceComposition
(
//     (particles2 in air)
//     {
//         type saturated;
//         species (gas);
//         Le 1.0;
//         saturationPressure
//         {
//             type ArdenBuck;
//         }
//     }
);

surfaceTension
(
    (air and particles1)
    {
        type            constant;
        sigma           0;
    }
    (air and particles2)
    {
        type            constant;
        sigma           0;
    }
    (particles1 and particles2)
    {
        type            constant;
        sigma           0;
    }
);


aspectRatio
(
);

drag
(
    (particles1 in air)
    {
        type            GidaspowErgunWenYu;
        residualRe      1e-3;
        swarmCorrection
        {
            type        none;
        }
    }
    (particles2 in air)
    {
        type            GidaspowErgunWenYu;
        residualRe      1e-3;
        swarmCorrection
        {
            type        none;
        }
    }
    (particles1 and particles2)
    {
        type            Syamlal;
        residualRe      1e-3;
        swarmCorrection
        {
            type        none;
        }
    }
);

virtualMass
(
);

heatTransfer.air
(
    (particles1 in air)
    {
        type RanzMarshall;
        residualAlpha 1e-4;
    }
    (particles2 in air)
    {
        type RanzMarshall;
        residualAlpha 1e-4;
    }
);
heatTransfer.particles1
(
    (particles1 in air)
    {
        type spherical;
        residualAlpha 1e-4;
    }
);
heatTransfer.particles2
(
    (particles2 in air)
    {
        type spherical;
        residualAlpha 1e-4;
    }
);

massTransfer.air
(
    (particles2 in air)
    {
        type Frossling;
        Le 1.0;
    }
);
massTransfer.particles1
(
);
massTransfer.particles2
(
    (particles2 in air)
    {
        type spherical;
        Le 1.0;
    }
);

lift
(
);

wallLubrication
(
);

turbulentDispersion
(
);

phaseTransfer
(
);

kineticTheory
{
    name                    Particles;
    alphaMax                0.63;
    residualAlpha           1e-4;

    packingLimitModel       YuStandish;
    radialModel             Lebowitz;
    viscosityModel          Princeton;
    conductivityModel       Princeton;
    granularPressureModel   Princeton;
    frictionalStressModel   JohnsonJackson;

    coeffRest
    (
        (particles1 and particles1) 0.8
        (particles1 and particles2) 0.8
        (particles2 and particles2) 0.8
    );
    coeffFric
    (
        (particles1 and particles1) 0.1
        (particles1 and particles2) 0.1
        (particles2 and particles2) 0.1
    );

    JohnsonJacksonCoeffs
    {
        alphaMinFriction        0.55;
        Fr                      0.05;
        eta                     2;
        p                       5;
        phi                     28.5;
        alphaDeltaMin           1e-3;
    }
}

// Minimum allowable pressure
pMin            10000;


// ************************************************************************* //
