tutorials/multiphase/reactingMultiphaseEulerFoam/RAS/fluidisedBedReaction/constant/thermophysicalProperties.particles2
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      thermophysicalProperties.particles2;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
thermoType
{
    type            heSolidThermo;
    mixture         reactingMixture;
    transport       constIso;
    thermo          hConst;
    equationOfState rhoConst;
    specie          specie;
    energy          sensibleEnthalpy;
}

chemistryReader foamChemistryReader;

foamChemistryFile "$FOAM_CASE/constant/reactions.particles2";

foamChemistryThermoFile "$FOAM_CASE/constant/thermo.particles2";


// ************************************************************************* //
