tutorials/multiphase/reactingMultiphaseEulerFoam/RAS/fluidisedBedReaction/0.org/T.particles1
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T.particles1;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions          [0 0 0 1 0 0 0];

internalField       uniform 300;

boundaryField
{
    inlet
    {
        type               fixedValue;
        value              uniform 550;
    }

    outlet
    {
        type               inletOutlet;
        phi                phi.particles1;
        inletValue         uniform 300;
        value              uniform 300;
    }

    walls
    {
        type               zeroGradient;
    }

    defaultFaces
    {
        type               empty;
    }
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
